#define CHAIRS 5 //Количество стульев для посетителей
typedef int semaphore; //Догадайтесь сами
semaphore customers = 0; //Количество ожидающих посетителей
semaphore barbers = 0; //Количество брадобреев, ждущих клиентов
semaphore mutex = 1; //Для взаимного исключения
int waiting = 0; //Ожидающие (не обслуживаемые) посетители

void barber(void)
{
 	while (TRUE) {
 		down(&customers); //Если посетителей нет, уйти в состояние ожидания
 		down(&mutex); //Запрос доступа к waiting
 		waiting = waiting-1; //Уменьшение числа ожидающих посетителей
 		up(&barbers); //Один брадобрей готов к работе
 		up(&mutex); //Отказ от доступа к waiting
 		cut hair(); //Клиента обслуживают (вне критической области)
 	}
}
void customer(void)
{
 	down(&mutex); //Вход в критическую область
 	if (waiting < CHAIRS) { //Если свободных стульев нет, придётся уйти
 		waiting = waiting + 1 //Увеличения числа ожидающих посетителей
 		up(&Customers); //При необходимости, разбудить брадобрея
 		up(&mutex); //Отказ от доступа к waiting
 		down(&barbers); //Если брадобрей занят, уйти в состояние ожидания
 		get_haircut(); //Клиента усаживают и обслуживают
} 	else {
 	up(&mutex); //Много посетителей, из парикмахерской придётся уйти
 	}
}
