#include <stdio.h>

int main()
{
/*
	int * ukaz1;		//объявление указателя
	double * ukaz2;

	int n=100;		//объявлние переменной
	double pi=3.1415926;

	ukaz1 = &n;		//присвоение указателю значения переменной
	ukaz2 = &pi;

	printf("variable address pi %p\n", ukaz2); //вывод значения указателя на экран
*/

	int a =100;
	int * p_a = &a;	//сохраняем в указатель адрес переменной а

	printf("a = %d\n", a);	// тут мы как обычно получаем значение переменной а
	printf("a = %d\n", *p_a); //тут мы получаем значение переменной, через указатель не нее

	// используя указатель p_a, записываем в переменную а другое значение
	*p_a = 50;

	printf("a =  %d\n", *p_a);
	return 0;

}
